tutorials/cylBumpinterOversetFoam/0/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           volScalarField;
    object          pd;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 -1 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
    oversetFaces
    {
        type overset;
        value uniform 0;
        coupledFringe yes;

        setHoleCellValue  yes;
        holeCellValue     0;
    }
    left
    {
        type zeroGradient;
    }
    right
    {
        type zeroGradient;
    }
    top
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    bottom
    {
        type zeroGradient;
    }
    cylinder
    {
        type zeroGradient;
    }
    outerCylinder
    {
        type zeroGradient;
    }
    cylBottom
    {
        type zeroGradient;
    }
    frontAndBack
    {
        type empty;
    }
}


// ************************************************************************* //
