tutorials/cylBumpinterOversetFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    // Background mesh
    (-1    0     0)
    ( 1    0     0)
    ( 1    2     0)
    (-1    2     0)
    (-1    0     0.1)
    ( 1    0     0.1)
    ( 1    2     0.1)
    (-1    2     0.1)

    (-0.5  0     0)
    (-0.25 0     0)
    ( 0.25 0     0)
    ( 0.5  0     0)
    ( 0    0.25  0)
    ( 0    0.5   0)

    (-0.5  0     0.1)
    (-0.25 0     0.1)
    ( 0.25 0     0.1)
    ( 0.5  0     0.1)
    ( 0    0.25  0.1)
    ( 0    0.5   0.1)
);

blocks
(
    // Background
    hex (0 1 2 3 4 5 6 7) background (80 80 1) simpleGrading (1 1 1)

    // Front
    hex (8 9 12 13 14 15 18 19) front (20 40 1) simpleGrading (0.25 1 1)
    hex (13 12 10 11 19 18 16 17) front (20 40 1) simpleGrading (0.25 1 1)

//     hex (8 9 12 13 14 15 18 19) front (10 30 1) simpleGrading (1 1 1)
//     hex (13 12 10 11 19 18 16 17) front (10 30 1) simpleGrading (1 1 1)
);

edges
(
    // Inner arc, back
    arc  9 12 ( -0.1767767  0.1767767 0)
    arc 12 10 (  0.1767767  0.1767767 0)

    // Inner arc, front
    arc 15 18 ( -0.1767767  0.1767767 0.1)
    arc 18 16 (  0.1767767  0.1767767 0.1)

    // Outer arc, back
    arc  8 13 ( -0.3535534  0.3535534 0)
    arc 13 11 (  0.3535534  0.3535534 0)

    // Outer arc, front
    arc 14 19 ( -0.3535534  0.3535534 0.1)
    arc 19 17 (  0.3535534  0.3535534 0.1)
);

patches
(
    wall left
    (
        (0 4 7 3)
    )
    wall right
    (
        (2 6 5 1)
    )
    patch top
    (
        (3 7 6 2)
    )
    wall bottom
    (
        (1 5 4 0)
    )
    wall cylinder
    (
        (9 12 18 15)
        (12 10 16 18)
    )

    patch outerCylinder
    (
        (8 14 19 13)
        (13 19 17 11)
    )

    wall cylBottom
    (
        (8 9 15 14)
        (10 11 17 16)
    )

    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)

        (8 13 12 9)
        (13 11 10 12)
        (14 15 18 19)
        (18 16 17 19)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
