tutorials/cylBumpinterOversetFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver           PCG;
        preconditioner   DIC;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0.01;
    }

    pd
    {
        solver           BiCGStab;
        preconditioner   DILU;

//         solver           PCG;
//         preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0.01;
    }

    pdFinal
    {
        solver           BiCGStab;
        preconditioner   DILU;

//         solver           PCG;
//         preconditioner   DIC;

        minIter          0;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0.0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          100;
        tolerance        1e-08;
        relTol           0;
    }

    alpha1
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          100;
        tolerance        1e-08;
        relTol           0;
    }
}

PISO
{
    cAlpha          1;
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors     6;
    nNonOrthogonalCorrectors 0;

    pdRefPoint      (-0.9 1.4 0.05);
    pdRefValue      0;

    pRefPoint      (-0.9 1.4 0.05);
    pRefValue      0;

    limitMagU      30;
}

relaxationFactors
{
    U          0.8;
    pd         0.7;
}


// ************************************************************************* //
